#### Prod Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.backend.null_resource.install_dependencies: Refreshing state... [id=1338761846404791356]
module.backend.stripe_product.vst["cool-synth-v1"]: Refreshing state... [id=prod_U1kR1qnHoVV7kk]
module.backend.data.archive_file.my_purchases_zip: Reading...
module.backend.local_file.product_config: Refreshing state... [id=30722a3403f120b197e4d1f14a813d4e44325d9c]
module.backend.data.archive_file.checkout_zip: Reading...
module.backend.data.archive_file.download_zip: Reading...
module.backend.data.archive_file.webhook_zip: Reading...
module.backend.data.archive_file.my_purchases_zip: Read complete after 0s [id=cdb72f57c6a904c8cfb8062b50e33356f1239e55]
module.backend.data.archive_file.checkout_zip: Read complete after 0s [id=35a359675c0e7dbcc21d22aceb891002c8c25a18]
module.backend.data.archive_file.webhook_zip: Read complete after 0s [id=e9b02f517e52118061d145bcd703caedbc5e6858]
module.backend.data.archive_file.download_zip: Read complete after 0s [id=fbef8255c1eb83c043fba717bc78b76310fbb690]
module.backend.data.archive_file.stripe_layer_zip: Reading...
module.backend.stripe_price.vst_price["cool-synth-v1"]: Refreshing state... [id=price_1T3gwsDyEyPnHPBn1BlNCxRf]
module.backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-prod]
module.frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E3LS99DT2QX8JW]
module.storage.aws_s3_bucket.vst_storage: Refreshing state... [id=vst-storage-prod-195481994910]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-prod123]
module.backend.aws_api_gateway_rest_api.api: Refreshing state... [id=ps1frit3ub]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_u7h4b6cDw]
module.database.aws_dynamodb_table.purchases: Refreshing state... [id=vstshop-purchases-prod]
module.backend.data.archive_file.stripe_layer_zip: Read complete after 0s [id=a957ad939d47bca0ec899aed0429564c37057a3c]
module.backend.aws_lambda_layer_version.stripe_layer: Refreshing state... [id=arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:7]
module.backend.aws_api_gateway_resource.my_purchases: Refreshing state... [id=sa4tvo]
module.backend.aws_api_gateway_resource.checkout: Refreshing state... [id=vijo3s]
module.backend.aws_api_gateway_resource.download: Refreshing state... [id=1ogy5n]
module.backend.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-ps1frit3ub-DEFAULT_5XX]
module.backend.aws_api_gateway_resource.webhook: Refreshing state... [id=z1n13q]
module.backend.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-ps1frit3ub-DEFAULT_4XX]
module.backend.module.checkout_cors.aws_api_gateway_method._: Refreshing state... [id=agm-ps1frit3ub-vijo3s-OPTIONS]
module.backend.aws_lambda_function.my_purchases: Refreshing state... [id=vstshop-my-purchases-prod]
module.backend.module.download_cors.aws_api_gateway_method._: Refreshing state... [id=agm-ps1frit3ub-1ogy5n-OPTIONS]
module.backend.aws_api_gateway_method.webhook_post: Refreshing state... [id=agm-ps1frit3ub-z1n13q-POST]
module.backend.module.my_purchases_cors.aws_api_gateway_method._: Refreshing state... [id=agm-ps1frit3ub-sa4tvo-OPTIONS]
module.backend.aws_lambda_function.stripe_webhook: Refreshing state... [id=vstshop-stripe-webhook-prod]
module.backend.module.checkout_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ps1frit3ub-vijo3s-OPTIONS-200]
module.backend.module.checkout_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-ps1frit3ub-vijo3s-OPTIONS]
module.backend.module.download_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ps1frit3ub-1ogy5n-OPTIONS-200]
module.backend.module.my_purchases_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ps1frit3ub-sa4tvo-OPTIONS-200]
module.backend.module.download_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-ps1frit3ub-1ogy5n-OPTIONS]
module.backend.module.my_purchases_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-ps1frit3ub-sa4tvo-OPTIONS]
module.backend.module.checkout_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ps1frit3ub-vijo3s-OPTIONS-200]
module.backend.module.download_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ps1frit3ub-1ogy5n-OPTIONS-200]
module.backend.module.my_purchases_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ps1frit3ub-sa4tvo-OPTIONS-200]
module.storage.aws_s3_bucket_public_access_block.vst_storage_block: Refreshing state... [id=vst-storage-prod-195481994910]
module.backend.aws_iam_policy.lambda_combined_policy: Refreshing state... [id=arn:aws:iam::212984412001:policy/vstshop-lambda-combined-policy-prod]
module.backend.aws_lambda_function.download: Refreshing state... [id=vstshop-download-prod]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-prod123]
module.backend.aws_lambda_permission.api_gw_my_purchases: Refreshing state... [id=AllowExecutionFromAPIGatewayPurchases]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2LWH7IMK7IDCO]
module.backend.aws_lambda_permission.apigw_webhook: Refreshing state... [id=AllowExecutionFromAPIGatewayWebhook]
module.backend.aws_api_gateway_integration.webhook_integration: Refreshing state... [id=agi-ps1frit3ub-z1n13q-POST]
module.backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-prod/arn:aws:iam::212984412001:policy/vstshop-lambda-combined-policy-prod]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-prod-vst-prod-123]
module.backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=ef4w2c]
module.backend.aws_api_gateway_method.checkout_post: Refreshing state... [id=agm-ps1frit3ub-vijo3s-POST]
module.backend.aws_api_gateway_method.download_get: Refreshing state... [id=agm-ps1frit3ub-1ogy5n-GET]
module.backend.aws_api_gateway_method.my_purchases_get: Refreshing state... [id=agm-ps1frit3ub-sa4tvo-GET]
module.frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-prod123]
module.storage.aws_s3_bucket_cors_configuration.vst_cors: Refreshing state... [id=vst-storage-prod-195481994910]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=722e9mqi8aag4njin0oafbbe8s]
module.backend.aws_lambda_function.checkout: Refreshing state... [id=vstshop-checkout-prod]
module.backend.aws_api_gateway_integration.my_purchases_int: Refreshing state... [id=agi-ps1frit3ub-sa4tvo-GET]
module.backend.aws_api_gateway_integration.download_integration: Refreshing state... [id=agi-ps1frit3ub-1ogy5n-GET]
module.backend.aws_lambda_permission.apigw_download: Refreshing state... [id=AllowExecutionFromAPIGatewayDownload]
module.backend.aws_lambda_permission.apigw_checkout: Refreshing state... [id=AllowExecutionFromAPIGatewayCheckout]
module.backend.aws_api_gateway_integration.checkout_integration: Refreshing state... [id=agi-ps1frit3ub-vijo3s-POST]
module.backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=wb8ymn]
module.backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-ps1frit3ub-prod]
local_file.env_file: Refreshing state... [id=ead1c6c86ca5e4290153c72cdfd108aa015f7801]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.env_file will be created
  + resource "local_file" "env_file" {
      + content              = <<-EOT
            VITE_AWS_REGION=us-east-2
            VITE_USER_POOL_ID=us-east-2_u7h4b6cDw
            VITE_USER_POOL_CLIENT_ID=722e9mqi8aag4njin0oafbbe8s
            VITE_API_URL=https://ps1frit3ub.execute-api.us-east-2.amazonaws.com/prod
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./../../../../services/vstshop-frontend/.env"
      + id                   = (known after apply)
    }

  # module.backend.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-ps1frit3ub-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.backend.aws_api_gateway_gateway_response.default_5xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {
        id                  = "aggr-ps1frit3ub-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.backend.aws_lambda_function.checkout will be updated in-place
  ~ resource "aws_lambda_function" "checkout" {
        id                             = "vstshop-checkout-prod"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:7",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "FRONTEND_URL"          = "https://d299hxdp1uizvy.cloudfront.net"
              - "STRIPE_PRODUCT_MAP"    = jsonencode(
                    {
                      - cool-synth-v1 = "price_1T3gwsDyEyPnHPBn1BlNCxRf"
                    }
                )
              - "STRIPE_SECRET_KEY"     = (sensitive value)
              - "STRIPE_WEBHOOK_SECRET" = (sensitive value)
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_function.download will be updated in-place
  ~ resource "aws_lambda_function" "download" {
        id                             = "vstshop-download-prod"
        tags                           = {}
        # (32 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "S3_KEY_MAP"     = jsonencode(
                  ~ {
                      ~ cool-synth-v1 = "cool-synth-v1.zip" -> "AcidSaturator.zip"
                    }
                )
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_function.stripe_webhook will be updated in-place
  ~ resource "aws_lambda_function" "stripe_webhook" {
        id                             = "vstshop-stripe-webhook-prod"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:7",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_layer_version.stripe_layer must be replaced
+/- resource "aws_lambda_layer_version" "stripe_layer" {
      ~ arn                         = "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:7" -> (known after apply)
      ~ code_sha256                 = "CBxWC5Ua3rNxLPj5iX3YsyLij/7zk/q9hdecdZYoV+8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-22T20:19:35.570+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod:7" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-2:212984412001:layer:vstshop-stripe-layer-prod" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "CBxWC5Ua3rNxLPj5iX3YsyLij/7zk/q9hdecdZYoV+8=" -> "6U4v30GwX/rc602HuDMa7TcRCQMiBOJru4t50s6E4u4=" # forces replacement
      ~ source_code_size            = 4678106 -> (known after apply)
      ~ version                     = "7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.backend.local_file.product_config will be created
  + resource "local_file" "product_config" {
      + content              = jsonencode(
            [
              + {
                  + id    = "cool-synth-v1"
                  + name  = "Acid Saturator"
                  + price = "$5.00"
                },
            ]
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../../modules/vstshop/backend/../../../../services/vstshop-frontend/src/product_config.json"
      + id                   = (known after apply)
    }

  # module.backend.stripe_price.vst_price["cool-synth-v1"] must be replaced
+/- resource "stripe_price" "vst_price" {
      ~ billing_scheme = "per_unit" -> (known after apply)
      ~ id             = "price_1T3gwsDyEyPnHPBn1BlNCxRf" -> (known after apply)
      + lookup_key     = (known after apply)
      ~ metadata       = {} -> (known after apply)
      + nickname       = (known after apply)
      ~ tax_behavior   = "unspecified" -> (known after apply)
      + tiers_mode     = (known after apply)
      ~ unit_amount    = 2999 -> 500 # forces replacement
        # (3 unchanged attributes hidden)

      ~ currency_options (known after apply)
    }

  # module.backend.stripe_product.vst["cool-synth-v1"] will be updated in-place
  ~ resource "stripe_product" "vst" {
        id                   = "prod_U1kR1qnHoVV7kk"
      ~ name                 = "Cool Synth VST" -> "Acid Saturator"
        # (8 unchanged attributes hidden)
    }

Plan: 4 to add, 6 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>